{'arxiv_id': 'arXiv:2501.01945', 'title': 'Cold-Start Recommendation towards the Era of Large Language Models (LLMs): A Comprehensive Survey and Roadmap', 'authors': 'Weizhi Zhang, Yuanchen Bei, Liangwei Yang, Henry Peng Zou, Peilin Zhou, Aiwei Liu, Yinghui Li, Hao Chen, Jianling Wang, Yu Wang, Feiran Huang, Sheng Zhou, Jiajun Bu, Allen Lin, James Caverlee, Fakhri Karray, Irwin King, Philip S. Yu', 'link': 'https://arxiv.org/abs/2501.01945', 'abstract': 'Cold-start problem is one of the long-standing challenges in recommender systems, focusing on accurately modeling new or interaction-limited users or items to provide better recommendations. Due to the diversification of internet platforms and the exponential growth of users and items, the importance of cold-start recommendation (CSR) is becoming increasingly evident. At the same time, large language models (LLMs) have achieved tremendous success and possess strong capabilities in modeling user and item information, providing new potential for cold-start recommendations. However, the research community on CSR still lacks a comprehensive review and reflection in this field. Based on this, in this paper, we stand in the context of the era of large language models and provide a comprehensive review and discussion on the roadmap, related literature, and future directions of CSR. Specifically, we have conducted an exploration of the development path of how existing CSR utilizes information, from content features, graph relations, and domain information, to the world knowledge possessed by large language models, aiming to provide new insights for both the research and industrial communities on CSR. Related resources of cold-start recommendations are collected and continuously updated for the community in this https URL.', 'abstract_zh': '冷启动问题是推荐系统中长期存在的挑战之一，主要集中在准确建模新用户或交互受限的用户或物品，以提供更好的推荐。由于互联网平台的多元化和用户及物品数量的指数级增长，冷启动推荐（CSR）的重要性愈发凸显。同时，大规模语言模型（LLMs）已经取得了巨大的成功，并且在用户和物品信息建模方面具备强大的能力，为冷启动推荐提供了新的潜力。然而，冷启动推荐研究领域仍然缺乏对该领域的全面回顾和反思。基于此，在本文中，我们站在大规模语言模型的时代背景下，对该领域的路线图、相关文献和未来方向进行了全面的回顾和讨论。具体地，我们对现有冷启动推荐如何利用信息的发展路径进行了探索，从内容特征、图关系、领域信息，到大规模语言模型所具备的世界知识，旨在为冷启动推荐领域的研究和工业界提供新的见解。我们还收集并不断更新冷启动推荐的相关资源，供社区参考，链接为：https://link_to_resources.com。', 'title_zh': '面向大型语言模型时代（LLMs）的冷启动推荐：综述与 roadmap'}
{'arxiv_id': 'arXiv:2501.01429', 'title': 'Item Association Factorization Mixed Markov Chains for Sequential Recommendation', 'authors': 'DongYu Du, Yue Chan', 'link': 'https://arxiv.org/abs/2501.01429', 'abstract': "Sequential recommendation refers to recommending the next item of interest for a specific user based on his/her historical behavior sequence up to a certain time. While previous research has extensively examined Markov chain-based sequential recommendation models, the majority of these studies has focused on the user's historical behavior sequence but has paid little attention to the overall correlation between items. This study introduces a sequential recommendation algorithm known as Item Association Factorization Mixed Markov Chains, which incorporates association information between items using an item association graph, integrating it with user behavior sequence information. Our experimental findings from the four public datasets demonstrate that the newly introduced algorithm significantly enhances the recommendation ranking results without substantially increasing the parameter count. Additionally, research on tuning the prior balancing parameters underscores the significance of incorporating item association information across different datasets.", 'abstract_zh': '基于历史行为序列的序列推荐是指根据特定用户在某一时间之前的Historical行为序列，推荐其感兴趣 的下一个项目。尽管以往的研究集中于基于马尔可夫链的序列推荐模型，但大多数研究主要关注用户的 历史行为序列，而忽视了项目之间整体的相关性。本研究介绍了一种称为Item Association Factorization Mixed Markov Chains（项目关联因子分解混合马尔可夫链）的序列推荐算法，该算法通过项目关联图引入项目之间的关联信息，并将其与用户行为序列信息结合起来。我们对四个公开数据集的实验结果表明，新引入的算法在显著提升推荐排序结果的同时并未显著增加参数数量。此外，针对先验平衡参数的调优研究强调了在不同数据集中引入项目关联信息的重要性。', 'title_zh': '项目关联因子分解混合马尔可夫链在顺序推荐中的应用'}
