{'arxiv_id': 'arXiv:2501.05289', 'title': 'Unraveling the Impact of Visual Complexity on Search as Learning', 'authors': 'Wolfgang Gritz, Anett Hoppe, Ralph Ewerth', 'link': 'https://arxiv.org/abs/2501.05289', 'abstract': 'Information search has become essential for learning and knowledge acquisition, offering broad access to information and learning resources. The visual complexity of web pages is known to influence search behavior, with previous work suggesting that searchers make evaluative judgments within the first second on a page. However, there is a significant gap in our understanding of how visual complexity impacts searches specifically conducted with a learning intent. This gap is particularly relevant for the development of optimized information retrieval (IR) systems that effectively support educational objectives. To address this research need, we model visual complexity and aesthetics via a diverse set of features, investigating their relationship with search behavior during learning-oriented web sessions. Our study utilizes a publicly available dataset from a lab study where participants learned about thunderstorm formation. Our findings reveal that while content relevance is the most significant predictor for knowledge gain, sessions with less visually complex pages are associated with higher learning success. This observation applies to features associated with the layout of web pages rather than to simpler features (e.g., number of images). The reported results shed light on the impact of visual complexity on learning-oriented searches, informing the design of more effective IR systems for educational contexts. To foster reproducibility, we release our source code (this https URL).', 'abstract_zh': '信息检索已成为学习和知识获取的基本工具，它提供了广泛的信息和学习资源的访问途径。网页的视觉复杂性已知会影响检索行为，以前的研究表明，检索者在进入页面的最初一秒钟内就会对其做出评价性的判断。然而，我们对视觉复杂性如何影响具有学习意图的检索行为的理解存在显著的空白。这一空白特别与开发能够有效支持教育目标的优化信息检索（信息检索，Information Retrieval, IR）系统相关。为了填补这一研究需求，我们通过一系列多样化的特征来建模视觉复杂性和美学，探讨这些特征与学习导向的网页会话中的检索行为之间的关系。本研究利用来自实验室研究的数据集，该研究涉及参与者关于雷暴形成的自我学习。我们的研究结果表明，尽管主题相关性是学习成果的最重要的预测因素，但视觉复杂度较低的页面与更高的学习成功率相关。这一观察结果适用于与网页布局相关的特征，而不适用于简单的特征（例如，图片数量）。我们报告的研究结果揭示了视觉复杂性对学习导向检索的影响，为教育背景下更有效的信息检索系统设计提供了参考。为了促进可重复性，我们发布了我们的源代码（[此链接](this https URL)）。', 'title_zh': '解析视觉复杂性对搜索作为学习影响的研究'}
{'arxiv_id': 'arXiv:2501.05170', 'title': 'De-centering the (Traditional) User: Multistakeholder Evaluation of Recommender Systems', 'authors': 'Robin Burke, Gediminas Adomavicius, Toine Bogers, Tommaso Di Noia, Dominik Kowald, Julia Neidhardt, Özlem Özgöbek, Maria Soledad Pera, Nava Tintarev, Jürgen Ziegler', 'link': 'https://arxiv.org/abs/2501.05170', 'abstract': 'Multistakeholder recommender systems are those that account for the impacts and preferences of multiple groups of individuals, not just the end users receiving recommendations. Due to their complexity, evaluating these systems cannot be restricted to the overall utility of a single stakeholder, as is often the case of more mainstream recommender system applications. In this article, we focus our discussion on the intricacies of the evaluation of multistakeholder recommender systems. We bring attention to the different aspects involved in the evaluation of multistakeholder recommender systems - from the range of stakeholders involved (including but not limited to producers and consumers) to the values and specific goals of each relevant stakeholder. Additionally, we discuss how to move from theoretical principles to practical implementation, providing specific use case examples. Finally, we outline open research directions for the RecSys community to explore. We aim to provide guidance to researchers and practitioners about how to think about these complex and domain-dependent issues of evaluation in the course of designing, developing, and researching applications with multistakeholder aspects.', 'abstract_zh': '多相关方推荐系统是指那些考虑到多个群体的影响和偏好，而不仅仅是接收推荐的最终用户。由于这些系统的复杂性，评估这些系统不能仅限于单一相关方的总体效用，这是更主流推荐系统应用中常见的做法。本文我们将重点讨论多相关方推荐系统评估的复杂性。我们将关注多相关方推荐系统评估中涉及的不同方面——从参与的多种相关方范围（包括但不限于生产者和消费者）到每个相关方的价值观和具体目标。此外，我们还将讨论如何从理论原则转向实际实施，并提供具体的案例。最后，我们提出了多相关方推荐系统研究领域的开放性研究方向。我们旨在为研究人员和实践者提供指导，帮助他们在设计、开发和研究具有多相关方特征的应用程序时思考这些复杂且领域特定的评估问题。', 'title_zh': '重新定位（传统意义上的）用户：多元利益相关者评价推荐系统'}
{'arxiv_id': 'arXiv:2501.05082', 'title': 'Comparison of Feature Learning Methods for Metadata Extraction from PDF Scholarly Documents', 'authors': 'Zeyd Boukhers, Cong Yang', 'link': 'https://arxiv.org/abs/2501.05082', 'abstract': 'The availability of metadata for scientific documents is pivotal in propelling scientific knowledge forward and for adhering to the FAIR principles (i.e. Findability, Accessibility, Interoperability, and Reusability) of research findings. However, the lack of sufficient metadata in published documents, particularly those from smaller and mid-sized publishers, hinders their accessibility. This issue is widespread in some disciplines, such as the German Social Sciences, where publications often employ diverse templates. To address this challenge, our study evaluates various feature learning and prediction methods, including natural language processing (NLP), computer vision (CV), and multimodal approaches, for extracting metadata from documents with high template variance. We aim to improve the accessibility of scientific documents and facilitate their wider use. To support our comparison of these methods, we provide comprehensive experimental results, analyzing their accuracy and efficiency in extracting metadata. Additionally, we provide valuable insights into the strengths and weaknesses of various feature learning and prediction methods, which can guide future research in this field.', 'abstract_zh': '科学文献元数据的可用性对于推进科学知识的发展以及遵循研究成果的FAIR原则（即可寻性、可访问性、互操作性和可重用性）至关重要。然而，特别是在小型和中型出版商的文献中，缺乏足够的元数据限制了这些文献的可访问性。这一问题在某些学科中尤为普遍，如德国社会科学领域，在该领域中，出版物通常使用多种多样的模板。为解决这一挑战，我们的研究评估了包括自然语言处理（NLP）、计算机视觉（CV）和多模态方法在内的各种特征学习和预测方法，以从具有高模板变异性文献中提取元数据。我们旨在提高科学文献的可访问性，促进其更广泛的使用。为了支持这些方法的比较，我们提供了全面的实验结果，分析了它们在提取元数据方面的准确性和效率。此外，我们还提供了各种特征学习和预测方法的优势和不足的有价值见解，这可以指导该领域未来的研究。', 'title_zh': 'PDF学术文档中元数据提取的特征学习方法比较'}
{'arxiv_id': 'arXiv:2501.05072', 'title': 'A Flexible and Scalable Framework for Video Moment Search', 'authors': 'Chongzhi Zhang, Xizhou Zhu, Aixin Sun', 'link': 'https://arxiv.org/abs/2501.05072', 'abstract': "Video moment search, the process of finding relevant moments in a video corpus to match a user's query, is crucial for various applications. Existing solutions, however, often assume a single perfect matching moment, struggle with inefficient inference, and have limitations with hour-long videos. This paper introduces a flexible and scalable framework for retrieving a ranked list of moments from collection of videos in any length to match a text query, a task termed Ranked Video Moment Retrieval (RVMR). Our framework, called Segment-Proposal-Ranking (SPR), simplifies the search process into three independent stages: segment retrieval, proposal generation, and moment refinement with re-ranking. Specifically, videos are divided into equal-length segments with precomputed embeddings indexed offline, allowing efficient retrieval regardless of video length. For scalable online retrieval, both segments and queries are projected into a shared feature space to enable approximate nearest neighbor (ANN) search. Retrieved segments are then merged into coarse-grained moment proposals. Then a refinement and re-ranking module is designed to reorder and adjust timestamps of the coarse-grained proposals. Evaluations on the TVR-Ranking dataset demonstrate that our framework achieves state-of-the-art performance with significant reductions in computational cost and processing time. The flexible design also allows for independent improvements to each stage, making SPR highly adaptable for large-scale applications.", 'abstract_zh': '视频片段搜索，即在视频库中查找与用户查询相关的片段的过程，对于多种应用至关重要。然而，现有的解决方案通常假设存在一个完美的匹配片段，且在推理效率和处理长视频方面存在局限性。本文提出了一种灵活且可扩展的框架，用于从长度各异的视频集合中检索排名列表，以匹配文本查询，这一任务称为排名视频片段检索（Ranked Video Moment Retrieval, RVMR）。我们的框架名为Segment-Proposal-Ranking（SPR），将搜索过程简化为三个独立阶段：片段检索、提案生成和通过重新排名的片段细化。具体而言，视频首先被划分为等长片段，预先计算的嵌入在离线索引中，从而不受视频长度的影响，实现高效检索。为了实现可扩展的在线检索，我们对片段和查询进行了投影，以生成共享特征空间，从而能够进行近似最近邻（ANNE）搜索。检索到的片段随后合并为粗粒度的片段提案。随后设计了一个细化和重新排名模块，用于重新排列和调整粗粒度提案的时间戳。在TVR-Ranking数据集上的评估表明，我们的框架在显著降低计算成本和处理时间方面达到了最先进的性能。此外，灵活的设计使得可以在每个阶段独立改进，使SPR在大规模应用中具有高度的适应性。', 'title_zh': '一种灵活可扩展的视频关键帧搜索框架'}
{'arxiv_id': 'arXiv:2501.05018', 'title': 'Finding Needles in Emb(a)dding Haystacks: Legal Document Retrieval via Bagging and SVR Ensembles', 'authors': 'Kevin Bönisch, Alexander Mehler', 'link': 'https://arxiv.org/abs/2501.05018', 'abstract': 'We introduce a retrieval approach leveraging Support Vector Regression (SVR) ensembles, bootstrap aggregation (bagging), and embedding spaces on the German Dataset for Legal Information Retrieval (GerDaLIR). By conceptualizing the retrieval task in terms of multiple binary needle-in-a-haystack subtasks, we show improved recall over the baselines (0.849 > 0.803 | 0.829) using our voting ensemble, suggesting promising initial results, without training or fine-tuning any deep learning models. Our approach holds potential for further enhancement, particularly through refining the encoding models and optimizing hyperparameters.', 'abstract_zh': '我们提出了一种利用支持向量回归（SVR）集成、自助聚合（bagging）以及嵌入空间的方法，应用于德国法律信息检索数据集（GerDaLIR）。通过将检索任务概念化为多个二分类的“needle-in-a-haystack”子任务，我们使用投票集成方法在基线之上取得了改进的召回率（0.849 > 0.803 | 0.829），这表明了初步的积极结果，且这一过程无需训练或微调任何深度学习模型。我们的方法具有进一步提升的潜力，特别是在改进编码模型和优化超参数方面。', 'title_zh': '在嵌入式干草堆中寻找针：基于袋装法和SVR集成的法律文档检索'}
{'arxiv_id': 'arXiv:2501.04802', 'title': 'Reproducing HotFlip for Corpus Poisoning Attacks in Dense Retrieval', 'authors': 'Yongkang Li, Panagiotis Eustratiadis, Evangelos Kanoulas', 'link': 'https://arxiv.org/abs/2501.04802', 'abstract': 'HotFlip is a topical gradient-based word substitution method for attacking language models. Recently, this method has been further applied to attack retrieval systems by generating malicious passages that are injected into a corpus, i.e., corpus poisoning. However, HotFlip is known to be computationally inefficient, with the majority of time being spent on gradient accumulation for each query-passage pair during the adversarial token generation phase, making it impossible to generate an adequate number of adversarial passages in a reasonable amount of time. Moreover, the attack method itself assumes access to a set of user queries, a strong assumption that does not correspond to how real-world adversarial attacks are usually performed. In this paper, we first significantly boost the efficiency of HotFlip, reducing the adversarial generation process from 4 hours per document to only 15 minutes, using the same hardware. We further contribute experiments and analysis on two additional tasks: (1) transfer-based black-box attacks, and (2) query-agnostic attacks. Whenever possible, we provide comparisons between the original method and our improved version. Our experiments demonstrate that HotFlip can effectively attack a variety of dense retrievers, with an observed trend that its attack performance diminishes against more advanced and recent methods. Interestingly, we observe that while HotFlip performs poorly in a black-box setting, indicating limited capacity for generalization, in query-agnostic scenarios its performance is correlated to the volume of injected adversarial passages.', 'abstract_zh': 'HotFlip是一种基于主题的梯度单词替换方法，用于攻击语言模型。最近，该方法被进一步应用于通过生成恶意段落并注入语料库来攻击检索系统，即语料库中毒。然而，HotFlip已知存在计算效率低下的问题，在对抗性词生成阶段，多数时间都花费在每个查询-段落对的梯度累积上，使得在合理的时间内无法生成足够的对抗性段落。此外，该攻击方法假设可以访问用户查询集，这是一个强烈的假设，不对应于实际世界中的大多数对抗性攻击的执行方式。在本文中，我们首先大幅提高了HotFlip的效率，将对抗性生成过程从每份文档4小时缩短至仅15分钟，使用相同的硬件。进一步地，我们还贡献了两个额外任务的实验和分析：（1）基于转移的黑盒攻击，以及（2）查询无感知攻击。在可能的情况下，我们提供了原始方法与改进版本之间的比较。我们的实验表明，HotFlip能够有效攻击多种密集检索系统，观察到其攻击性能随更先进和更新方法的增加而逐渐减弱的趋势。有趣的是，我们发现虽然HotFlip在黑盒设置下表现不佳，表明其泛化能力有限，但在查询无感知场景中，其性能与注入的对抗性段落数量相关。', 'title_zh': '复现 HotFlip 对于密集检索中语料污染攻击的效果'}
{'arxiv_id': 'arXiv:2501.04762', 'title': 'Efficient and Responsible Adaptation of Large Language Models for Robust and Equitable Top-k Recommendations', 'authors': 'Kirandeep Kaur, Manya Chadha, Vinayak Gupta, Chirag Shah', 'link': 'https://arxiv.org/abs/2501.04762', 'abstract': "Conventional recommendation systems (RSs) are typically optimized to enhance performance metrics uniformly across all training samples, inadvertently overlooking the needs of diverse user populations. The performance disparity among various populations can harm the model's robustness to sub-populations due to the varying user properties. While large language models (LLMs) show promise in enhancing RS performance, their practical applicability is hindered by high costs, inference latency, and degraded performance on long user queries. To address these challenges, we propose a hybrid task allocation framework designed to promote social good by equitably serving all user groups. By adopting a two-phase approach, we promote a strategic assignment of tasks for efficient and responsible adaptation of LLMs. Our strategy works by first identifying the weak and inactive users that receive a suboptimal ranking performance by RSs. Next, we use an in-context learning approach for such users, wherein each user interaction history is contextualized as a distinct ranking task. We evaluate our hybrid framework by incorporating eight different recommendation algorithms and three different LLMs -- both open and close-sourced. Our results on three real-world datasets show a significant reduction in weak users and improved robustness to subpopulations without disproportionately escalating costs.", 'abstract_zh': '传统的推荐系统（RS）通常被优化为在所有训练样本上均匀提高性能指标，从而不可避免地忽略了多元用户群体的需求。不同用户群体之间的性能差异会因用户属性的不同而使模型对子群体的鲁棒性受损。虽然大规模语言模型（LLMs）在提高RS性能方面显示出潜力，但其实际应用受到高成本、推理延迟以及在长查询用户上性能下降的阻碍。为了解决这些问题，我们提出了一种混合任务分配框架，旨在通过公平服务所有用户群体促进社会福祉。通过采用两阶段的方法，我们推动了LLMs的有效和负责任的适应性。我们的策略首先通过识别那些在RS排名表现不佳的弱用户和不活跃用户来发挥作用。接着，我们为这些用户采用上下文学习方法，将每个用户的交互历史作为独立的排名任务进行个性化处理。我们通过结合八种不同的推荐算法和三种不同的LLM（开源和封闭源）来评估我们的混合框架。在三个真实世界数据集上的结果表明，我们的框架在减少弱用户和提高对子群体的鲁棒性方面表现出显著效果，同时未对成本造成不成比例的增长。', 'title_zh': '高效且负责任的大语言模型适配以实现稳健且公平的Top-k推荐'}
{'arxiv_id': 'arXiv:2501.05366', 'title': 'Search-o1: Agentic Search-Enhanced Large Reasoning Models', 'authors': 'Xiaoxi Li, Guanting Dong, Jiajie Jin, Yuyao Zhang, Yujia Zhou, Yutao Zhu, Peitian Zhang, Zhicheng Dou', 'link': 'https://arxiv.org/abs/2501.05366', 'abstract': 'Large reasoning models (LRMs) like OpenAI-o1 have demonstrated impressive long stepwise reasoning capabilities through large-scale reinforcement learning. However, their extended reasoning processes often suffer from knowledge insufficiency, leading to frequent uncertainties and potential errors. To address this limitation, we introduce \\textbf{Search-o1}, a framework that enhances LRMs with an agentic retrieval-augmented generation (RAG) mechanism and a Reason-in-Documents module for refining retrieved documents. Search-o1 integrates an agentic search workflow into the reasoning process, enabling dynamic retrieval of external knowledge when LRMs encounter uncertain knowledge points. Additionally, due to the verbose nature of retrieved documents, we design a separate Reason-in-Documents module to deeply analyze the retrieved information before injecting it into the reasoning chain, minimizing noise and preserving coherent reasoning flow. Extensive experiments on complex reasoning tasks in science, mathematics, and coding, as well as six open-domain QA benchmarks, demonstrate the strong performance of Search-o1. This approach enhances the trustworthiness and applicability of LRMs in complex reasoning tasks, paving the way for more reliable and versatile intelligent systems. The code is available at \\url{this https URL}.', 'abstract_zh': '以下是论文内容或标题的中文翻译，符合学术规范：\n\n大型推理模型（LRMs）如OpenAI-o1通过大规模强化学习展示了出色的逐步推理能力。然而，它们的延伸推理过程常常受到知识不足的影响，导致频繁出现不确定性甚至潜在错误。为了解决这一局限性，我们引入了**Search-o1**框架，该框架通过将代理检索增强生成（RAG）机制与文档内推理模块结合来增强LRMs。Search-o1将代理搜索工作流整合到推理过程中，使LRMs在遇到不确定的知识点时能够动态地检索外部知识。此外，由于检索到的文档内容较为冗长，我们专门设计了一个文档内推理模块，在将这些信息注入推理链之前对其进行深入分析，从而减少噪声并保持连贯的推理流程。在科学、数学和编程等复杂推理任务以及六个开放域QA基准测试中，深入实验展示了Search-o1的强大性能。这一方法增强了LRMs在复杂推理任务中的可信度和适用性，为更可靠和多功能的智能系统铺平了道路。相关代码请参见 [此链接](this https URL)。', 'title_zh': 'Search-o1：自主搜索增强的大规模推理模型'}
{'arxiv_id': 'arXiv:2501.05220', 'title': 'A Novel Approach to Scalable and Automatic Topic-Controlled Question Generation in Education', 'authors': 'Ziqing Li, Mutlu Cukurova, Sahan Bulathwela', 'link': 'https://arxiv.org/abs/2501.05220', 'abstract': "The development of Automatic Question Generation (QG) models has the potential to significantly improve educational practices by reducing the teacher workload associated with creating educational content. This paper introduces a novel approach to educational question generation that controls the topical focus of questions. The proposed Topic-Controlled Question Generation (T-CQG) method enhances the relevance and effectiveness of the generated content for educational purposes. Our approach uses fine-tuning on a pre-trained T5-small model, employing specially created datasets tailored to educational needs. The research further explores the impacts of pre-training strategies, quantisation, and data augmentation on the model's performance. We specifically address the challenge of generating semantically aligned questions with paragraph-level contexts, thereby improving the topic specificity of the generated questions. In addition, we introduce and explore novel evaluation methods to assess the topical relatedness of the generated questions. Our results, validated through rigorous offline and human-backed evaluations, demonstrate that the proposed models effectively generate high-quality, topic-focused questions. These models have the potential to reduce teacher workload and support personalised tutoring systems by serving as bespoke question generators. With its relatively small number of parameters, the proposals not only advance the capabilities of question generation models for handling specific educational topics but also offer a scalable solution that reduces infrastructure costs. This scalability makes them feasible for widespread use in education without reliance on proprietary large language models like ChatGPT.", 'abstract_zh': '自动问题生成（QG）模型的发展有可能显著改善教育实践，减少教师在创建教育内容方面的工作量。本文介绍了一种新颖的教育问题生成方法，该方法能够控制问题的主题焦点。我们提出的主题控制问题生成（T-CQG）方法提升了生成内容的相关性和教育有效性。我们的方法利用预训练的T5-small模型进行微调，并使用特制的数据集，以满足教育需求。研究进一步探讨了预训练策略、量化和数据增强对模型性能的影响。我们特别解决了与段落级背景语境生成语义一致问题的挑战，从而提高了生成问题的主题特定性。此外，我们引入并探索了新的评估方法，以评估生成问题的主题相关性。通过严格的离线和人类辅助评估，我们的结果表明，所提出模型能够有效生成高质量的主题导向问题。这些模型有能力减少教师的工作量，支持个性化辅导系统，并作为定制问题生成器发挥作用。由于其参数较少，这些提议不仅提升了处理特定教育主题的问题生成模型的能力，还提供了一种可扩展的解决方案，能够降低基础设施成本。这种可扩展性使得它们在无需依赖ChatGPT等专有大型语言模型的情况下，适用于广泛应用于教育领域。', 'title_zh': '一种新型的可扩展且自动的主题控制型问题生成方法在教育中的应用'}
